documents/images/graphio/bxdf/gltf_image_float_float_1_0_instance.dot
digraph {
  rankdir = LR;
    NG_gltf_image_float_float_1_0_scale_image [label= "multiply"];
    NG_gltf_image_float_float_1_0_scale_image[shape = box];
    NG_gltf_image_float_float_1_0_scale_image ->     NG_gltf_image_float_float_1_0_out;
    NG_gltf_image_float_float_1_0_out [label= "out"];
    NG_gltf_image_float_float_1_0_out[shape = box]; 
    NG_gltf_image_float_float_1_0_factorINT [label="factor"];
    NG_gltf_image_float_float_1_0_factorINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_scale_image [label="multiply"];
    NG_gltf_image_float_float_1_0_factorINT -> NG_gltf_image_float_float_1_0_scale_image [label=".in1"];
    NG_gltf_image_float_float_1_0_image [label= "image"];
    NG_gltf_image_float_float_1_0_image[shape = box];
    NG_gltf_image_float_float_1_0_image ->     NG_gltf_image_float_float_1_0_scale_image [label= "in2"];
    NG_gltf_image_float_float_1_0_scale_image [label= "multiply"];
    NG_gltf_image_float_float_1_0_scale_image[shape = box]; 
    NG_gltf_image_float_float_1_0_fileINT [label="file"];
    NG_gltf_image_float_float_1_0_fileINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_image [label="image"];
    NG_gltf_image_float_float_1_0_fileINT -> NG_gltf_image_float_float_1_0_image [label=".file"];
    NG_gltf_image_float_float_1_0_defaultINT [label="default"];
    NG_gltf_image_float_float_1_0_defaultINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_image [label="image"];
    NG_gltf_image_float_float_1_0_defaultINT -> NG_gltf_image_float_float_1_0_image [label=".default"];
    NG_gltf_image_float_float_1_0_uaddressmodeINT [label="uaddressmode"];
    NG_gltf_image_float_float_1_0_uaddressmodeINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_image [label="image"];
    NG_gltf_image_float_float_1_0_uaddressmodeINT -> NG_gltf_image_float_float_1_0_image [label=".uaddressmode"];
    NG_gltf_image_float_float_1_0_vaddressmodeINT [label="vaddressmode"];
    NG_gltf_image_float_float_1_0_vaddressmodeINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_image [label="image"];
    NG_gltf_image_float_float_1_0_vaddressmodeINT -> NG_gltf_image_float_float_1_0_image [label=".vaddressmode"];
    NG_gltf_image_float_float_1_0_filtertypeINT [label="filtertype"];
    NG_gltf_image_float_float_1_0_filtertypeINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_image [label="image"];
    NG_gltf_image_float_float_1_0_filtertypeINT -> NG_gltf_image_float_float_1_0_image [label=".filtertype"];
    NG_gltf_image_float_float_1_0_place2d [label= "place2d"];
    NG_gltf_image_float_float_1_0_place2d[shape = box];
    NG_gltf_image_float_float_1_0_place2d ->     NG_gltf_image_float_float_1_0_image [label= "texcoord"];
    NG_gltf_image_float_float_1_0_image [label= "image"];
    NG_gltf_image_float_float_1_0_image[shape = box]; 
    NG_gltf_image_float_float_1_0_pivotINT [label="pivot"];
    NG_gltf_image_float_float_1_0_pivotINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_place2d [label="place2d"];
    NG_gltf_image_float_float_1_0_pivotINT -> NG_gltf_image_float_float_1_0_place2d [label=".pivot"];
    NG_gltf_image_float_float_1_0_operationorderINT [label="operationorder"];
    NG_gltf_image_float_float_1_0_operationorderINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_place2d [label="place2d"];
    NG_gltf_image_float_float_1_0_operationorderINT -> NG_gltf_image_float_float_1_0_place2d [label=".operationorder"];
    NG_gltf_image_float_float_1_0_texcoord1 [label= "texcoord"];
    NG_gltf_image_float_float_1_0_texcoord1[shape = box];
    NG_gltf_image_float_float_1_0_texcoord1 ->     NG_gltf_image_float_float_1_0_place2d [label= "texcoord"];
    NG_gltf_image_float_float_1_0_place2d [label= "place2d"];
    NG_gltf_image_float_float_1_0_place2d[shape = box]; 
    NG_gltf_image_float_float_1_0_uvindexINT [label="uvindex"];
    NG_gltf_image_float_float_1_0_uvindexINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_texcoord1 [label="texcoord"];
    NG_gltf_image_float_float_1_0_uvindexINT -> NG_gltf_image_float_float_1_0_texcoord1 [label=".index"];
    NG_gltf_image_float_float_1_0_invert_scale [label= "divide"];
    NG_gltf_image_float_float_1_0_invert_scale[shape = box];
    NG_gltf_image_float_float_1_0_invert_scale ->     NG_gltf_image_float_float_1_0_place2d [label= "scale"];
    NG_gltf_image_float_float_1_0_place2d [label= "place2d"];
    NG_gltf_image_float_float_1_0_place2d[shape = box]; 
    NG_gltf_image_float_float_1_0_scaleINT [label="scale"];
    NG_gltf_image_float_float_1_0_scaleINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_invert_scale [label="divide"];
    NG_gltf_image_float_float_1_0_scaleINT -> NG_gltf_image_float_float_1_0_invert_scale [label=".in2"];
    NG_gltf_image_float_float_1_0_negate_rotate [label= "multiply"];
    NG_gltf_image_float_float_1_0_negate_rotate[shape = box];
    NG_gltf_image_float_float_1_0_negate_rotate ->     NG_gltf_image_float_float_1_0_place2d [label= "rotate"];
    NG_gltf_image_float_float_1_0_place2d [label= "place2d"];
    NG_gltf_image_float_float_1_0_place2d[shape = box]; 
    NG_gltf_image_float_float_1_0_rotateINT [label="rotate"];
    NG_gltf_image_float_float_1_0_rotateINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_negate_rotate [label="multiply"];
    NG_gltf_image_float_float_1_0_rotateINT -> NG_gltf_image_float_float_1_0_negate_rotate [label=".in1"];
    NG_gltf_image_float_float_1_0_negate_offset [label= "multiply"];
    NG_gltf_image_float_float_1_0_negate_offset[shape = box];
    NG_gltf_image_float_float_1_0_negate_offset ->     NG_gltf_image_float_float_1_0_place2d [label= "offset"];
    NG_gltf_image_float_float_1_0_place2d [label= "place2d"];
    NG_gltf_image_float_float_1_0_place2d[shape = box]; 
    NG_gltf_image_float_float_1_0_offsetINT [label="offset"];
    NG_gltf_image_float_float_1_0_offsetINT [shape = ellipse];
    NG_gltf_image_float_float_1_0_negate_offset [label="multiply"];
    NG_gltf_image_float_float_1_0_offsetINT -> NG_gltf_image_float_float_1_0_negate_offset [label=".in1"];
}
